jaowens14/DeltaTPlus_STM32WB55RG_0925/DeltaTPlus_STM32WB55RG_090525/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wbxx_hal.h"

#include "app_conf.h"
#include "app_entry.h"
#include "app_common.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TFT_BACKLIGHT_Pin GPIO_PIN_0
#define TFT_BACKLIGHT_GPIO_Port GPIOA
#define TFT_RESET_Pin GPIO_PIN_1
#define TFT_RESET_GPIO_Port GPIOA
#define TFT_RS_DC_Pin GPIO_PIN_2
#define TFT_RS_DC_GPIO_Port GPIOA
#define TFT_CS_Pin GPIO_PIN_4
#define TFT_CS_GPIO_Port GPIOA
#define CTP_INT_Pin GPIO_PIN_4
#define CTP_INT_GPIO_Port GPIOC
#define CTP_INT_EXTI_IRQn EXTI4_IRQn
#define GPIO_CTP_RESET_Pin GPIO_PIN_5
#define GPIO_CTP_RESET_GPIO_Port GPIOC
#define ad7234_io_Pin GPIO_PIN_2
#define ad7234_io_GPIO_Port GPIOB
#define ADC_CS_Pin GPIO_PIN_12
#define ADC_CS_GPIO_Port GPIOB
#define ACCEL_INT1_Pin GPIO_PIN_11
#define ACCEL_INT1_GPIO_Port GPIOC
#define ACCEL_INT1_EXTI_IRQn EXTI15_10_IRQn
#define ACCEL_INT2_Pin GPIO_PIN_12
#define ACCEL_INT2_GPIO_Port GPIOC
#define ACCEL_INT2_EXTI_IRQn EXTI15_10_IRQn
#define ADC_CSB5_Pin GPIO_PIN_5
#define ADC_CSB5_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
  // void SPI_Set_Mode(uint8_t mode);
  extern uint8_t UART_BUFFER[256];

  double RNG_GetRandomDouble(double min, double max);


  void SystemClock_Config(void);
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
